// ####Задача 1

// Перепишите код, заменив оператор `if` на тернарный оператор `?`

// ```js
// var result;
// if (a + b < 4) {
// result = true;
// } else {
// result = false;
// }

// var result;
 
// #### Задача 1 РЕШЕНИЕ
// var result = (a + b < 4) ? true : false;


////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ####Задача 2

// Перепишите `if..else` с использованием нескольких операторов `?`.

// Для читаемости — оформляйте код в несколько строк.

// ```js
// var message;

// if (login == 'Pitter') {
// message = 'Hi';
// } else if (login == 'Owner') {
// message = 'Hello';
// } else if (login == '') {
// message = 'unknown';
// } else {
// message = '';
// }
// ```

// #### Задача 2 РЕШЕНИЕ

// var login = "Pitter";

// var message = (login == 'Pitter') ? 'Hi':
//     (login == 'Owner') ? 'Hello':
//     (login == '') ? 'unknown':
//     '';
// console.log(message)

////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// ####Задача 3

// Перепишите код, заменив оператор `switch` на оператор `if..else`:

// ```js
// switch (val) {
    // case 'a':
    // console.log( 'a' );
// break;
    // case 'b':
    // case 'c':
    // case 'd':
    // case 'e':
// console.log( 'others' );
// break;
// default:
// console.log( 'unknown' );
// }

// #### Задача 3 РЕШЕНИЕ

// var  val = 'ddd';
// if (val == 'a') {
//     console.log('a');
// } else if (val =='b') {
//     console.log('others');
// } else if (val == 'с') {
//     console.log('others');
// } else if (val == 'd') {
//     console.log('others');
// } else if (val == 'e') {
//     console.log('others');
// } else {
//     console.log('unknown');
// }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////



// ####Задача 4

// Перепишите код с использованием одной конструкции `switch`:

// ```js
// var a = 0;

// if (a == 0) {
// console.log( 0 );
// }
// if (a == 1) {
// console.log( 1 );
// }

// if (a == 2 || a == 3) {
// console.log( '2,3' );
// }
// ```

// #### Задача 4 РЕШЕНИЕ
// var a = 0;

// switch (a) {
//     case 0:
//     console.log( '0' );
//         break;
//     case 1:
//         console.log( '1' );
//         break;
//     case 2:
//     case 3:
//         console.log( '2,3' );
//         break;
// }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ####Задача 5

// Перепишите код, заменив цикл `for` на `while`, без изменения поведения цикла.

// ```js
// for (var i = 0; i < 3; i++) {
// console.log(i);
// }
// ```
// #### Задача 5 РЕШЕНИЕ
// let i = 0;
// while (i < 3) {
//   console.log(i);
//   i++;
// }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ####Задача 6

// Написать код который посчитает сумму всех элементов в масиве.

// ```js
// var arr = [1,2,3,4];
// ```

// **Внимание**!

// - Не разрашается использовать специальные методы массивов.

// #### Задача 6 РЕШЕНИЕ

// var arr = [1,2,3,4];
// function arrSum(array){
//      var sum = 0; 
//      for(var i = 0; i < array.length; i++) { 
//          sum += array[i]; 
//      } 
//      console.log(sum); 
//     } 
//     arrSum(arr); 

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ####Задача 7

// Написать код который посчитает сумму всех четных элементов в массиве.

// ```js
// var arr = [1,2,3,4];
// ```

// **Внимание**!

// - Не разрашается использовать специальные методы массивов.

// #### Задача 7 РЕШЕНИЕ

// var arr = [1,2,3,4];

// const getOdd = (arr) => {
//   let sum = 0;
//   for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 === 0) {
//     sum = sum + arr[i];
//     }
//   }
//   return sum;
// }
// console.log(getOdd(arr));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// ####Задача 8

// Написать код который посчитает сумму всех четных элементов в массиве, в суммировании уча́ствуют только элементы больше 3.

// ```js
// var arr = [1,2,3,4];
// ```

// **Внимание**!

// - Не разрашается использовать специальные методы массивов.

// #### Задача 8 РЕШЕНИЕ
// var arr = [4,4,4,4]; // поменял чтобы проверить работу 
// const getOdd = (arr) => {
//   let sum = 0;
  
//   for (let i = 0; i < arr.length; i++) {
//     if (arr[i]>3 && arr[i] % 2 === 0) {
//     sum = sum + arr[i];
//     }
//   }
//   return sum;
// }
// console.log(getOdd(arr));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// #### Задача 9

// Отсортировать массив по убыванию.

// ```javascript
// var arr = [1,2,3,4,5,6];
// // [6,5,4,3,2,1]
// ```

// **Внимание**!

// - Не разрашается использовать специальные методы массивов.

// #### Задача 9 РЕШЕНИЕ

// var arr = [1,2,3,4,5,6];
// const sort = a => {
//     let len = a.length - 1;
    
//     for(let i = 0; i < len; i++)
//         for(var e = 0; e < len - i; e++)
//           if(a[e] < a[e + 1])
//             [a[e], a[e + 1]] = [a[e + 1], a[e]];
    
//     return a;
//   };
  
//   console.info(sort(arr));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// #### Задача 10

// Отсортировать массив по возрастанию.

// ```javascript
// var arr = [6,5,4,3,2,1];
// // [1,2,3,4,5,6]
// ```

// **Внимание**!

// - Не разрашается использовать специальные методы массивов.

// #### Задача 10 РЕШЕНИЕ

// var arr = [9,2,3,4,5,6]; // поменял значение для проверки
// const sort = a => {
//     let len = a.length - 1;
    
//     for(let i = 0; i < len; i++)
//         for(var e = 0; e < len - i; e++)
//           if(a[e] > a[e + 1])
//             [a[e], a[e + 1]] = [a[e + 1], a[e]];
    
//     return a;
//   };
  
//   console.info(sort(arr));

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// #### Задача 11

// Дан массив с элементами `[2, 5, 9, 15, 0, 4]`.
// С помощью цикла `for` и оператора `if` выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.

// **Внимание**!

// - Не разрашается использовать специальные методы массивов.

// #### Задача 11 РЕШЕНИЕ

// var arr = [2, 5, 9, 15, 0, 4]; 
//     for (var i = 0; i < arr.length; i++) {
// 	    if (arr[i] > 3 && arr[i] < 10) document.write(arr[i]+'<br>');
// 	        } // вывело 5,4,9 



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// #### Задача 12

// Дан массив с числами: `[1,2,3,-5,-2,1,-4]`

// Найдите сумму положительных элементов массива. В результате вы должны получить число `7`

// **Внимание**!

// - Не разрашается использовать специальные методы массивов.

// #### Задача 12 РЕШЕНИЕ

// var arr = [1,2,3,-5,-2,1,-4]
// const getPositive = (arr) => {
//   let sum = 0;
  
//   for (let i = 0; i < arr.length; i++) {
//     if (arr[i]>0) {
//     sum = sum + arr[i];
//     }
//   }
//   return sum;
// }
// console.log(getPositive(arr)); // выводит 7 

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


// #### Задача 13

// Дан массив с элементами `[1, 2, 5, 9, 4, 13, 4, 10]`. С помощью цикла `for` и оператора `if` проверьте есть ли в
// массиве элемент со значением, равным 4. 
// Если есть — выведите на экран `Есть!` и выйдите из цикла. Если нет - ничего делать не надо.


// #### Задача 13 РЕШЕНИЕ

// var arr = [1, 2, 5, 9, 4, 13, 4, 10]
// for (var i = 0; i < arr.length; i++) {
//     	    if (arr[i] == 4) {
//                 document.write("Eсть" '<br>');
//                 break; 
//             }
//         }  // Выводит Есть 

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// #### Задача 14

// Дано число `n=1000`. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? 
// Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную `num`.
            
// #### Задача 14 РЕШЕНИЕ

// for (let n = 1000, num = 0; n > 50; num++) {

//     n /= 2;
//     document.write( n +'<br>');
    
//     alert("Количество итераций: "+num);

//     }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////